#lang at-exp racket/base

(require ycao-net/lib/markup)

(define post
  @article["软件工程无法靠代码生成解决" "2026-10-16" #:lang "zh"]{
    @para{
      大概从 Claude Opus 4.5 发布前后开始，LLM 与智能体编程终于变得有用了。
      但事实证明，用 AI 写软件仍然并不简单。就我自己而言，我一直觉得 vibe-coding 的过程@it{很痛苦}。这并不是说智能体编程无用或低效，而是它@it{很痛苦}。
    }
    @para{
      根源在于，软工在工程与数学之间处在一个古怪的位置。一方面，我们确实关心，而且大多只关心软工中实际、现实世界的问题；这与 @link["https://teorth.github.io/tao-web/slides/math-2-0-caltech-2026.pdf"]{陶哲轩的 Math 2.0 演讲} 形成对比——他在其中不恰当地设想了一个人们不懂医学的概念性场景。至少在过去 50 年里，我们做数学是为了好玩；而且必须承认，数学已经闯进了一场凭空搭建的思维游戏，我们不该假装自己研究数学主要是希望它有实际用途。
    }
    @blockquote{
        因此，数学或许可以定义为这样一门学科：我们始终不知道自己在谈什么，也不知道自己说的是否为真。我希望，那些曾为数学的开端感到困惑的人，能从这一定义中得到安慰，并且多半会同意它是准确的。
        @cite["russellMysticismLogicOther1917"]
    }
    @para{
      刚才有点跑题，但反正这不是一篇严格论文；还是回到软工吧。话说回来，软工也不同于传统工程：它与物理世界的联系非常薄弱。我们仍像其他工程学科一样，用先验构造来建模问题，但主要处理的是人的意图和需求，而不是自然。后者有客观真值，而前者没有。这让软工在进行形式化描述（代码）时拥有惊人的灵活性，而这成了问题。
    }
    @para{
      计科大致分两部分：理论和应用。理论主要是离散数学和复杂度理论；应用则更多涉及管理与协调人员、组织形式语言（代码）以满足未来需求这些细微之处。“应用”计科，即软工，其本质是把模糊的自然语言翻译成形式语言。
    }
    @para{
      在软工过程中，以下两种情形必有一种适用，且穷尽所有情况：
      @ol{
        @item{
          你以形式化的方式陈述需求。既然经验观察表明，LLM 在解决定义明确的形式化问题（例如
          @link["https://www.phoronix.com/news/Linus-Torvalds-Claude-Code"]{优化}、
          @link["https://openai.com/index/hugging-face-incident-and-the-road-ahead/"]{逆向工程 / 网络安全}，
          或 @link["https://github.com/openai/math/"]{一般性的先验数学问题}）时似乎表现很好，
          那么大多数时候它都能奏效。
          @bold{但此时你本质上是在自己写代码，而大多数软工都可以看作构造性证明。}
        }
        @item{
          你没有以形式化的方式陈述需求。这时，LLM 会开始猜测并填补你自然语言中的空缺。由于这种性质，形式构造可能变得相当任意。有时，因为 LLM 公司通过后训练把“最佳实践”灌输进模型，它们碰巧正确；有时则会偏离。@bold{结果就是不可避免地失去控制、偏离本意。}
        }
      }
    }
    @para{
      举些轶事或许有帮助，但做过软工的人应该一眼就明白，所以我这里就偷懒了。
      归根结底，我们在实现并反复迭代之前，其实并不完全理解自己的需求。说来好笑，这正是我们一开始要雇架构师和产品经理的原因。
    }
    @para{
      当然可以辩称，“理论上 LLM 能做人类正在做的任何事”，但迄今为止我没看到任何迹象。它们从未提出优美而富有洞见的数学抽象，也从未在某种情境下自主判断一个抽象优于另一个。
    }
  }
)

; 翻译提示：SE翻译为“软工”，是软件工程简写。CS翻译为“计科”，计算机科学。RL指强化学习，这里应该翻译为“后训练”。

(provide post)