#lang at-exp racket/base

(require ycao-net/lib/markup)

(define post
  @article["软件工程无法靠代码生成解决" "2026-10-16" #:lang "zh"]{
    @para{
      大概从 Claude Opus 4.5 发布前后起，LLM 与智能体编程终于变得有用了。
      但事实证明，用 AI 写软件仍然不是易事。就我个人而言，我一直觉得 vibe-coding 的过程很 @it{痛苦}。
      这并不是说智能体编程无用或低效，而是说它确实 @it{痛苦}。
    }
    @para{
      根源在于，软工在工程与数学之间处在一个奇怪的位置。一方面，我们确实关心、而且大多只关心
      软工中实际、现实世界的问题；这与
      @link["https://teorth.github.io/tao-web/slides/math-2-0-caltech-2026.pdf"]{陶哲轩的 Math 2.0 演讲}
      形成对比——他在演讲里不恰当地举了一个人们不懂医学的概念性场景。至少在过去五十年里，
      我们做数学是为了好玩，而且必须承认，数学已经闯进了一场凭空搭建的思维游戏；
      我们也不该假装自己研究数学主要是希望它有实际用途。
    }
    @blockquote{
        因此，数学可以定义为这样一门学科：我们永远不知道自己在谈论什么，也不知道自己说的是否为真。
        我希望，那些被数学的开端所困惑的人，能从这个定义中得到安慰，并且大概会同意它是准确的。
        @cite["russellMysticismLogicOther1917"]
    }
    @para{
      刚才有点跑题，不过本文本来也不是严格论文；我们还是回到软工。
      话虽如此，软工也不同于传统工程，它与物理世界的联系非常薄弱。我们仍像其他工程学科一样，
      用先验构造来建模问题，但我们主要处理人的意图与需求，而不是自然。后者有客观真值，前者没有。
      这让软工在执行形式化描述（代码）时拥有惊人的灵活性，而这就成了问题。
    }
    @para{
      计科大致由理论与应用两部分组成。理论部分主要包括离散数学和复杂性理论；应用部分则更多涉及
      人员管理与协调，以及组织形式语言（代码）以照顾未来需求。“应用”计科，也就是软工，
      其本质是把模糊的自然语言翻译成形式语言。
    }
    @para{
      在软工过程中，下面两种情况必居其一，且穷尽所有可能：
      @ol{
        @item{
          你以形式化方式陈述需求。既然经验观察表明，LLM 在解决定义明确的形式问题时似乎表现得很好
          （例如
          @link["https://www.phoronix.com/news/Linus-Torvalds-Claude-Code"]{优化}、
          @link["https://openai.com/index/hugging-face-incident-and-the-road-ahead/"]{逆向工程 / 网络安全}，
          或 @link["https://github.com/openai/math/"]{一般意义上的先验数学问题}），
          大多数时候这会奏效。
          @bold{但到了这一步，你本质上是在自己写代码，而大多数软工都可以看作构造性证明。}
        }
        @item{
          你没有以形式化方式陈述需求。这时，LLM 开始猜测并填补你自然语言中的空白。由于这种性质，
          形式构造可能变得相当随意。有时它们碰巧正确，是因为 LLM 公司通过后训练把“最佳实践”注入模型；
          有时则会偏离。@bold{这不可避免地导致失控和偏离意图。}
        }
      }
    }
    @para{
      举几个轶事也许有帮助，但做过软工的人应该一眼就能看出这一点，所以我就在这里偷个懒。
      归根结底，我们在实现并迭代需求之前，其实并不完全理解自己的需求。有趣的是，这正是我们一开始
      要请架构师和产品经理的原因。
    }
    @para{
      当然可以争辩说，“理论上 LLM 能做人正在做的任何事”，但到目前为止，我没有看到任何迹象。
      它们从未提出过优美、有洞见的数学抽象，也从未在某种情境下自主判定某个抽象比另一个更好。
    }
  }
)

; 翻译提示：SE翻译为“软工”，是软件工程简写。CS翻译为“计科”，计算机科学。RL指强化学习，这里应该翻译为“后训练”。

(provide post)