#lang at-exp racket/base

(require ycao-net/lib/markup)

(define post
  @article["数学教育与 LLM" "2026-06-16" #:lang "zh"]{
    @para{@it{
        摘要：本文给数学与数学教育下定义，并论证：无论 LLM 能力如何，学习数学（或其他任何高度抽象的学科）所需的人力都有一个下界。
    }}

    @para{
      LLM 发展迅猛；不到一年，AI 就能解决数学问题——我们原以为数学是最难被 AI 自动化的领域——但它们正在逼近。不管 OpenAI 的这个 @link["https://openai.com/index/model-disproves-discrete-geometry-conjecture/"]{营销噱头} 是真是假（当然有人类帮忙，帮了多少？我们永远无法知道……），至少可以说，前沿模型对辅助数学研究有作用。这里自然要问：AI 对数学教育有帮助吗？有多大帮助？
    }

    @para{
      数学与其他所有科学都截然不同，因为它根本不自然——尽管大学总喜欢把数学系安置在某种物理科学大楼里。数学虽然起源于对物理世界的计数和度量，却已在 @link["https://en.wikipedia.org/wiki/Formalism_(philosophy_of_mathematics)"]{形式主义} 运动中脱离物理语境，演变成一门只关注先验推理与抽象的学科。我更愿意把数学定义为“对先验构造的研究”。我也喜欢把全部数学知识看成一个无限大的定理图：若一个定理能借助所选公理从另一个定理推出，就有一个节点指向另一个节点。在这个有趣的视角下，数学很像艺术、诗歌或音乐：每个定理都早已 @link["https://en.wikipedia.org/wiki/G%C3%B6del_numbering"]{存在于某处}，我们只是在发现它们。这个观点意味着，人类必须在数学研究中占有一席之地，因为一个抽象或定理是否有意思、是否值得发展，最终要由人类来评判。数学与个人和集体的品味与智识紧密相连：@it{“数学的产物是清晰与理解，而不是定理本身。”} @cite{budneyWhatsMathematician2010}
    }

    @para{
      因此，计算或定理证明只是做数学的一小部分，目标更在于培养良好的直觉 @cite{taoThereMoreMathematics2026}——能够流畅地穿行并操作某些层次的抽象，从而“感觉”出如何从一个节点走到另一个节点，或哪些节点值得探索。人们过去从物理性质中发展出抽象，比如发明微积分是为了描述连续物理现象。但如今，抽象已远离物理世界，以至于数学抽象常常先于任何应用被发明出来：十九世纪发明的黎曼几何，如今成了广义相对论（1915）的语言。
    }

    @para{
      数学教育之难正在于此：数学本身是最严格的学科，而好的数学教育有何特征，却偏偏难以界定，且极大依赖人的创造力与诠释。我最多只能列举好的数学教育的一些特征：我学数学学得最好的时候，是正深入到材料之中，突然“通了”，能预判接下来是什么。这种“顿悟时刻”让我想起 Grant Sanderson 在他的 @link["https://www.youtube.com/@3Blue1Brown"]{频道} 里反复强调的“希望你觉得自己本来也能重新发明 <math topic>”。这也与认知心理学中的“生成效应” @cite{slameckaGenerationEffect1978} 相符：该效应指出，人如果自己生成答案，而不是只读答案，会记得更牢。依我的经验，写提示词并非易事，写一本好到足以引导学生获得“顿悟时刻”的教科书也并非易事。
    }

    @para{
      无论 LLM 能力如何，学数学仍然需要不可忽视的最低人力投入；既然数学的核心是建立对抽象的直觉，那么古老的、寻常的、或许也是唯一的办法，就是接触并练习大量具体例子，之后才能理解建立某种抽象的动机，也才能完全把握抽象本身。例如，“群”这个抽象要求你先见过大量整数、实数、多项式、模算术、矩阵等等，然后才会明白我们为什么需要这样的东西。这一步跳不过去。
    }

    @para{
      我写这篇文章，是因为读了 @link["https://www.dailycal.org/news/campus/academics/failing-grades-soar-as-professors-see-greater-ai-usage-dwindling-math-skills-in-uc-berkeley/article_16fad0bf-02cb-4b8c-8d88-888ffd9f8608.html"]{《Daily Californian》关于 UCB 的报道}：不及格成绩飙升 @it{与 AI 使用增加相关}。这与我上面的观点一致：要建立数学能力，总得下苦功；同时也暴露出有问题的一面，问题不在 LLM 本身，而在人的懒惰。不过，这并不意味着学生因为 AI 变得更懒，而是说 AI 为懒惰清除了许多阻力：过去人们互相抄作业、用谷歌搜答案，现在只要让 AI 解任意数学题就行。既然确实有人真心愿意把一辈子投进数学，懒惰也许不是人的本性，而是有缺陷的教育制度的产物。解决办法超出本文范围，但肯定不能靠简单“禁止 AI”找到。
    }
  })

(provide post)