#lang at-exp racket/base

(require ycao-net/lib/markup)

(define post
  @article["数学教育，与 LLM" "2026-06-16" #:lang "zh"]{
    @para{@it{
        摘要：本文界定数学与数学教育，并论证：无论 LLM 能力如何，学习数学（或任何其他高度依赖抽象的学科）仍需要不可省略的最低限度的人类努力。
    }}

    @para{
      LLM 正在快速演进；一年之内，AI 已能处理数学问题——我们曾以为这类问题最难被 AI 自动化——但它们正逐步做到。无论 OpenAI 的
      @link["https://openai.com/index/model-disproves-discrete-geometry-conjecture/"]{营销噱头}
      是否属实（当然有人类参与，参与了多少？我们永远无从知晓……），至少可以说，前沿模型有助于辅助数学研究。这里自然会问：AI 对数学教育有帮助吗？有多大帮助？
    }

    @para{
      数学与所有其他科学都不同，它根本不自然，尽管大学总喜欢把数学系安排进某种物理科学楼里。它虽起源于对物理世界的计数与测量，却在
      @link["https://en.wikipedia.org/wiki/Formalism_(philosophy_of_mathematics)"]{形式主义}
      运动期间脱离物理学语境，演变成一门只关注先验推理与抽象的学科。我更愿意把数学定义为“对先验构造的研究”。我也愿意把全部数学知识想成一张无限大的定理图：若一个节点可由另一个节点借助所选公理推出，它就指向另一个节点。从这个有趣的视角看，数学很像艺术、诗歌或音乐：每条定理都已经
      @link["https://en.wikipedia.org/wiki/G%C3%B6del_numbering"]{存在于某处}，我们只是在发现它们。这一观点意味着，人类必须在数学研究中占有一席之地，因为最终判断一个抽象或定理是否有趣、是否值得发展的，是我们。数学与个人及集体的品味和智识紧密相连：@it{“数学的产物是清晰与理解。而非定理本身。”} @cite{budneyWhatsMathematician2010}
    }

    @para{
      因此，计算或定理证明只是做数学的一小部分，目标更在于培养良好的直觉 @cite{taoThereMoreMathematics2026}——能够流畅地穿行并操作某些层次的抽象，从而“感知”如何从一个节点走到另一个节点，或哪些节点值得探索。人们过去从物理性质中发展抽象，比如发明微积分来描述连续物理现象。但如今，抽象已远离物理世界，常常是先发明数学抽象，之后才找到应用：黎曼几何是 19 世纪的发明，如今成了广义相对论（1915）的语言。
    }

    @para{
      数学教育难就难在这里：数学本身是最严谨的学科，而好的数学教育却奇妙地难以定义，其特性高度依赖人的创造力与解释。我只能列举好的数学教育的一些特点：当我正处在材料中间，突然“开窍”，能预测下一步时，我数学学得最好。“顿悟时刻”让我想起 Grant Sanderson 在其
      @link["https://www.youtube.com/@3Blue1Brown"]{频道}
      中反复强调的“想让你觉得自己本可以亲自重新发明 <数学主题>”。这也与认知心理学中的“生成效应” @cite{slameckaGenerationEffect1978} 一致：人若自己生成答案，而不只是阅读答案，会记得更牢。以我的经验，写好提示词并不简单，正如写一本足以引导学生获得“顿悟时刻”的教科书并不简单。
    }

    @para{
      无论 LLM 能力如何，学习数学仍然需要不可省略的最低限度的人类努力；数学归根结底是在建立对抽象的直觉，而旧的、寻常的、也许唯一的方法，就是观察并练习大量具体例子，之后才能理解建立某种抽象的动机，之后才能完全把握抽象本身。例如，“群”这一抽象要求你先见过大量整数、实数、多项式、模算术、矩阵等等，然后才知道我们为什么需要这样的东西。这一步跳不过去。
    }

    @para{
      我写这篇文章，是因为读了 @link["https://www.dailycal.org/news/campus/academics/failing-grades-soar-as-professors-see-greater-ai-usage-dwindling-math-skills-in-uc-berkeley/article_16fad0bf-02cb-4b8c-8d88-888ffd9f8608.html"]{《每日加州人》关于 UCB 的报道}：不及格成绩激增与 AI 使用增加 @it{相关}。这与我上面的观点一致：要建立数学技能，总得下苦功；它也揭示了有问题的一面，问题不在 LLM 本身，而在人的懒惰。不过，这并不意味着学生因 AI 变得更懒，而是 AI 为懒惰清除了许多阻力：过去人们互相抄作业、上网搜答案，现在只要让 AI 解任意数学题就行。既然确实有人真心愿意把一生投入数学，懒惰也许并非人的本性，而是有缺陷的教育制度的产物。解决办法超出本文范围，但肯定不能靠简单地“禁止 AI”找到。
    }
  })

(provide post)