#lang at-exp racket/base

(require ycao-net/lib/markup)

(define post
  @article["《死亡搁浅》玩后感及艺术评论思考" "2025-11-15"]{
    @para{
      今日通关了《死亡搁浅》，不得不提，在游玩时我本以为这是后疫情作品在反思疫情隔离，没想到实际上游戏刚好于19年发售，真是巧合。
    }
    @para{
      《死亡搁浅》最独到的地方，在于实现了作者表达、剧情和游戏性的统一。小岛秀夫的主要创作意图是体现人与人之间互帮互助的重要性，游戏的剧情便是Sam作为“送货人”将后末日世界中支离破碎的美国重新连接。创新点在于，游戏的核心玩法——送货——直接服务于这一主题。它无时无刻不在用“送货的艰辛”与“其他玩家留下的建筑所带来的帮助”形成鲜明对比，点赞系统也让玩家在帮助他人时获得反馈，大多数玩家都有类似的情感经验（举例@cite["ds-review-1"]）。
    }
    @para{
      《死亡搁浅》的评价不出意料地出现分歧，主要集中在游戏性不强，玩法单一。@cite["ds-review-2"]@cite["ds-review-3"]Sylvester在他的《游戏设计》中提出，游戏是“体验生成引擎”@cite["ds-review-4"]，也就是用游戏独有的交互性（机制、系统）生成特定的体验（experience）。《死亡搁浅》的游戏性争议来源于玩家并没有期待它的交互（游戏性）部分被刻意地设计为无聊、困难和恐怖以衬托其主题。但若是以体验传递的角度分析，玩家成功感受到了情感——小岛秀夫所希望玩家体验到的“艰苦”、“孤独”和“互助”——这便是游戏设计成功的体现。传统观点认为游戏必须“好玩”，但好玩也是一种情感体验，具体可以细分为成就感（沙盒、竞技常见）、爽感（精美画面、大场面等（爆米花电影中也频繁使用，是惯常的懒惰套路））等。传统游戏评论期望游戏可以且仅可以在“交互”中带来“好玩”，却忽略了其它的排列组合，也就是动态交互（游戏机制）和传统艺术（过场动画、美术、剧情）可以表达传统艺术的表达，如作者的喜怒哀乐、对社会问题的反思。
    }
    @para{
      此评价框架可以被进一步泛化：游戏与传统文娱的区别在于，传统文娱产品（文学、电影、绘画等）运用叙事和/或视听手段，而游戏则运用交互手段，但他们的目标都为将情感体验传递给受众。评价一段文学、音乐、电影、游戏“好”，所指应为作者成功使读者体验到了他设计过的情感。人与人交流信息会需要证明一些命题，证明本身定然是理性（logos）或者感性（pathos）二选一，晓之以理便是论文，动之以情便是艺术。
    }
    @para{
      2025/12/07追加：本文混淆了“艺术评价”和“艺术家创作评价”，前者不是良定义的/尚存争议。
    }
  })

(provide post)
