#lang at-exp racket/base

(require ycao-net/lib/markup)

(define post
  @article["《缺氧》玩后感" "2026-10-21" #:lang "zh"]{
    @para{
      这篇文章欠了缺氧好久。此游戏耗费我宝贵的六百七十六个小时青春。越想越觉得精妙，设计无可挑剔、难以改进。
    }
    @img["/files/20261021/yuhua.webp" #:scale 0.4]{妈的，这么牛逼，我操}
    @para{
      游戏的目的（注意区别于异化后的娱乐。笔者本人极其厌恶在线游戏等以营利为主要目的的作品，本质为资本主义剥削用户注意力，
      和短视频等批判方式相同。）与传统艺术并无不一，本质都是使得观众/游玩者获得特定的情感体验。在传统艺术的基础上，游戏
      多了“交互性”这一工具，使得艺术表达边界获得极大的拓展。@cite["sylvesterDesigningGamesGuide2013"]
    }
    @para{
      缺氧在传统故事性上只能说聊胜于无，在游戏特有的“互动性”上确做到了极致。考虑缺氧有以下几个主要系统：
      @ul{
        @item{
          简单的一格一物细胞自动机启发式求解器
          @ul{
            @item{朴素热扩散}
            @item{朴素气液扩散}
            @item{朴素物质相变}
          }
        }
        @item{
          覆盖在细胞格点上的图结构
          @ul{
            @item{有向图气液固管道}
            @item{连通图电力系统}
            @item{线性的抽象机器，如电解水}
          }
        }
        @item{
          复制人优先队列工作和线性的生存需求
        }
      }
    }
    @para{
      系统首要的好处便是简洁。大多数系统都是对现实生活中已有的物理简化抽象，减少玩家认知负担。线性的复制人和机器同样使得
      游戏行为易于预测（legible），也避免过于非线性或混沌系统下玩家无法做出选择和设计（non-decision）。“复制人需要生
      存”这一设定（fictional wrapper）也直接作用于情绪，给予玩家明确的目标和充足的动机。
    }
    @para{
      ONI系统涌现性极佳。最为经典的例子便是，由“热扩散”与“有向图气液固管道”两者可以组建出现实工业生产中的逆流换热。基于
      游戏的CA模拟，游戏也涌现出了“液锁”“无限存储”“真空隔热”等有趣的、对玩家有使用价值的方法。但这
      只是游戏冰山一角。考虑一个典型游戏流程：“收集资源->自动化->可再生”，其中除了科技树，大多数目标都是间接设计，并在
      游玩过程中涌现出的。如“热扩散”不仅仅作为一些机器的运行原理，也驱动游戏发展。大多数“线性机器”都会以产热的方式与“热
      扩散”交互，到游戏中期便会以区域过热，无法开展生产作为问题抛给玩家 —— 玩家短期的解决方案自然成为了长期的问题。最终
      游戏便和群星一样，短目标和长目标交错，可预测且有情感基础，驱使人“再玩一cycle”。
    }
    @para{
      总体而言，ONI成功地在直观、涌现、简洁中取得了完美的平衡。其他注重交互性和系统模拟的游戏：
      @ul{
        @item{传统4X，如文明和群星 - 太多东西都是线性的了，设计师不得不一直堆额外内容}
        @item{Minecraft （尤其是电路） - 过于反直觉}
        @item{KSP - 相当好玩，但是系统不直观且过于缺少引导，缺少目标}
        @item{Noita - 风味堆栈演算且缺少引导，过于难以上手}
        @item{Factorio、Rim World - 还没玩过，或许比ONI更好，待我有时间品鉴一下}
      }
      不过ONI也有一些缺点。最显著的便是万能解决方案：著名的液冷/蒸汽机循环可以直接从环境中删除热量，大大减少了解空间并破
      坏了ONI最有创新的热扩散系统。同样，ONI的引导比KSP好不了多少，也是劝退新玩家的一大难题。
    }
    @para{
      （汉语欧化严重没救了，我真得多读点书吧）
    }
  }
)

(provide post)
