#lang at-exp racket/base

(require ycao-net/lib/markup)

(define post-ow-review
  @article["《星际拓荒》玩后感" "2025-09-02"]{
    @blockquote{
        以下内容包含对Outer Wilds剧情的剧透。
    }
    @para{
        Outer Wilds是一部以探索的方式，献给探索者的赞歌。
    }
    @para{
        自伊始以来，人类祖先天然对远处充满好奇。对“那边”的好奇驱使我们走出非洲大陆，在地球上开枝散叶。Outer Wilds直指人类天然的好奇，游戏没有目标，只有开始天文台的些许指引，剩下的道路需要玩家顺着一个个未知现象自己走出。一开始，玩家急于知道面具是什么；然后地面上零零星星的遗迹吸引着玩家的兴趣；而Nomai文物上字里行间透出的零碎信息又将玩家带入更深的地方。“我发现了！”这一古老的欣喜不断驱动着玩家，给予各种不同的经历。
    }
    @para{
        Outer Wilds中，没有传统意义上的成长：玩家不会获得新的道具，取得更高的数值。每一个循环结束，改变的只有玩家掌握的知识。但神奇之处就在于一次次的循环里，这些知识真切地带来了改变。玩家渐渐理解了过去，通晓宇宙的规律。玩家需要的不是一个数值，一个钥匙，只是一段信息。所有或简单或复杂，乃至可以帮助宇宙脱离循环的结构，从第一次在篝火睁开双眼以来，就一直躺在那里，等待着玩家用一系列特定的动作将其发掘。
    }
    @para{
        很多游戏都给谜题套上叙事的外皮，而Outer Wilds则用谜题叙事。游戏的高潮发生于破碎的故事串联在一起，描绘出一部悲壮的史诗。我最为震撼的经历在轨道探测器追踪站：电脑显示出Nomai文明为了绕过超新星只爆发一次（显而易见）的限制，利用时间循环保留数据；通过反复随机地探测9M+次，遍历了整个星系的空间，找到了Eye of the Universe。每次循环的开始，主角睁开眼睛就可以看到探测器被随机地射入深空，其实就是Nomai在几十万年后仍在苦苦寻找答案。在若干关键节点，玩家都可以感受到所谓Aha Moment。因所有线索都由玩家经历万难拼凑出，这些“突然醒悟”带来了无比强烈的冲击力。
    }
    @para{
        游戏结局给这部史诗画上了圆满而富有哲理的句号：我握着高级跃迁核心——Nomai的科技结晶——冒着结束太阳系的风险，重启了废弃的飞船。Final Voyage主旋律与循环结束音乐一样，却多了额外的频率，讲述着Nomai持续几十万年却被意外停止的狂奔，最后一块拼图被玩家合上，也暗示了“这次有所不同”。Eye幻化出博物馆和树林，在其中旧宇宙走向热寂；Nomai骸骨前一刻还在望向星空，一眨眼的功夫飞船就向未知奔去；量子态的探索者们围在一起，用最后一曲勾勒出新的宇宙。一代代探索者的坚持与牺牲才托举着现代文明在巨人肩膀上到达了如此的高度。
    }
    @para{
        Outer Wilds有且只有探索这一个玩法，但这就够了，因探索是人类最古老最宝贵的本能。
    }
  })

(provide post-ow-review)
